In [3]:
import numpy as np
import pandas as pd

In [4]:
df1 = pd.DataFrame({"var1": np.random.normal(size=(10,)), "var2": np.random.choice([0, 1, 2], size=(10,))})
df2 = pd.DataFrame({"var1": np.random.normal(size=(2,)), "var2": np.random.choice([0, 1, 2], size=(2,))})

<a id="contents"></a>

# Contents
<a href=#append>Add the rows of one dataframe under another</a><br>
<a href=#filter_range>Filter by a range of values</a><br>
<a href=#idxmax>Find the index of the maximum/minimum value</a><br>
<a href=#join>Joins</a><br>
<a href=#rename>Renaming columns</a><br>
<a href=#group_range>Group by a range of values</a><br>
<a href=#string>Apply string methods to Series</a><br>
<a href=#regex>Divide string Series into columns using regular expressions</a><br>
<a href=#unique_values>Unique value counts</a><br>
<a href=#replace>Replace values</a><br>
<a href=#agg_multiple>Aggregate using more than 1 function</a><br>
<a href=#agg_custom>Aggregate using a custom function</a><br>
<a href=#onehot>One-hot encoding</a><br>
<a href=#listcolumns>Transform a list Series into columns</a><br>
<a href=#overwrite>Overwrite a single value</a><br>

<a id="append"></a>

## Add the rows of one dataframe under another

<b>pd.concat()</b>

In [5]:
df1.tail()

       var1  var2
5 -0.309393     0
6  1.176776     2
7  0.176825     2
8 -0.459895     2
9  0.857005     0

In [6]:
df2.head()

       var1  var2
0 -0.944842     2
1  0.215360     1

In [7]:
df = pd.concat([df1, df2])
df.tail()

       var1  var2
7  0.176825     2
8 -0.459895     2
9  0.857005     0
0 -0.944842     2
1  0.215360     1

<a href=#contents>Back to contents</a>

<a id="filter_range"></a>

## Filter by a range of values

<b>*df*.isin()</b>

In [8]:
df1[df1["var2"].isin([0, 1])]

       var1  var2
1 -1.394267     1
3  1.276325     1
4  0.984417     1
5 -0.309393     0
9  0.857005     0

<a href=#contents>Back to contents</a>

<a id="idxmax"></a>


## Find the index of the maximum/minimum value

<b>*df*.idxmax()</b>

In [9]:
df1["var1"].idxmax()

3

In [10]:
df1.iloc[df1["var1"].idxmax()]

var1    1.276325
var2    1.000000
Name: 3, dtype: float64

<a href=#contents>Back to contents</a>

<a id="join"></a>

## Joins

<b>pd.merge()</b>

In [11]:
df2["var3"] = np.random.binomial(10, 0.8, size=(2,))

In [12]:
df = pd.merge(df1, df2, how="inner", on="var2")

In [13]:
df.head()

     var1_x  var2    var1_y  var3
0  1.070325     2 -0.944842     7
1 -0.255291     2 -0.944842     7
2  1.176776     2 -0.944842     7
3  0.176825     2 -0.944842     7
4 -0.459895     2 -0.944842     7

<a href=#contents>Back to contents</a>

<a id="rename"></a>

## Renaming columns

<b>*df*.rename()</b>

In [14]:
df = df.rename(columns={"var1_x": "var1x", "var1_y": "var1y"})

In [15]:
df.columns

Index(['var1x', 'var2', 'var1y', 'var3'], dtype='object')

<a href=#contents>Back to contents</a>

<a id="group_range"></a>

## Group by a range of values

<b>*df*.groupby(pd.cut(*df*[*var*], *range*))</b>

In [16]:
df1.groupby(pd.cut(df1["var1"], np.arange(-2, 2, 0.5))).count()[["var1"]].rename(columns={"var1": "count"})

              count
var1
(-2.0, -1.5]      0
(-1.5, -1.0]      1
(-1.0, -0.5]      0
(-0.5, 0.0]       3
(0.0, 0.5]        1
(0.5, 1.0]        2
(1.0, 1.5]        3

<a href=#contents>Back to contents</a>

<a id="string"></a>

## Apply string methods to Series

<b>*series*.str.*method*</b>

In [17]:
df2["var4"] = ["$TexT", "$tttteXt"]
df2["var5"] = ["AA-3", "DF-1"]

In [18]:
df2["var4"].str.lower().str.replace("$", "")

0       text
1    ttttext
Name: var4, dtype: object

In [19]:
df2["var5"].str.split("-")

0    [AA, 3]
1    [DF, 1]
Name: var5, dtype: object

<a href=#contents>Back to contents</a>

<a id="regex"></a>

## Divide string Series into columns using regular expressions

<b>*series*.str.replace(*delimiter*, "").str.extract(*regular expression*)

In [20]:
df2["var5"].str.replace("-","").str.extract((r"(?P<part1>[A-Z])" r"(?P<part2>[0-9])"))

  part1 part2
0     A     3
1     F     1

<a href=#contents>Back to contents</a>

<a id="unique_values"></a>

## Unique value counts

<b>*df*.value_counts()</b>

In [21]:
df1["var2"].value_counts()

2    5
1    3
0    2
Name: var2, dtype: int64

<a href=#contents>Back to contents</a>

<a id="replace"></a>

## Replace values

<b>*series*.replace([*old_values*], [*new_values*])</b>

In [22]:
df1["var2"].replace([0, 1, 2], ["A", "B", "C"])

0    C
1    B
2    C
3    B
4    B
5    A
6    C
7    C
8    C
9    A
Name: var2, dtype: object

<a href=#contents>Back to contents</a>

<a id="agg_multiple"></a>

## Aggregate using more than 1 function

<b>*df*.groupby(*var*).agg([*f1*, *f2*, ...])

In [23]:
df1.groupby("var2").agg([np.mean, np.max, np.min])

          var1
          mean      amax      amin
var2
0     0.273806  0.857005 -0.309393
1     0.288825  1.276325 -1.394267
2     0.341748  1.176776 -0.459895

<a href=#contents>Back to contents</a>

<a id="agg_custom"></a>

## Aggregate using a custom function

<b>*df*.groupby(*var*).agg(*function*)</b>

In [24]:
df1.groupby("var2").agg(lambda x: np.mean(x)**2 + np.max(x))

          var1
var2
0     0.931975
1     1.359745
2     1.293568

<a href=#contents>Back to contents</a>

<a id="onehot"></a>

## One-hot encoding

<b>pd.get_dummies(*series*)<b>

In [25]:
pd.get_dummies(df1["var2"])

   0  1  2
0  0  0  1
1  0  1  0
2  0  0  1
3  0  1  0
4  0  1  0
5  1  0  0
6  0  0  1
7  0  0  1
8  0  0  1
9  1  0  0

<a href=#contents>Back to contents</a>

<a id="listcolumns"></a>

## Transform a list Series into columns

<b>

In [26]:
df4 = pd.DataFrame({"var5": [["AA", 3], ["BB", 5]]})
df4

      var5
0  [AA, 3]
1  [BB, 5]

In [27]:
pd.DataFrame(df4["var5"].values.tolist(), columns=['part1','part2'])

  part1  part2
0    AA      3
1    BB      5

<a href=#contents>Back to contents</a>

<a id="overwrite"></a>

## Overwrite a single value

<b>*df*.at[*index*, *column_name*]</b>

In [29]:
df1.loc[0, "var2"]

2

In [30]:
df1.at[0, "var2"] = 1

In [31]:
df1.loc[0, "var2"]

1

<a href=#contents>Back to contents</a>